driver-tests/bpelse/assign/AssignJbi/test/CopydecimalInvoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echo/"
                   xmlns="urn:DataType">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
   <decimalPart>
	<xsd_decimal>10.00005</xsd_decimal>
        <optional_decimal>1.05005</optional_decimal>
	<repeat_decimal>1.05005</repeat_decimal>
	<repeat_decimal>10.00505</repeat_decimal>
   </decimalPart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
